


--[[local addonName, addonTable = "GuildProf", {}
--Table with codex text (key = page number)
chapter1 = {}
--chapter1.Page1
chapter1[1] = 'Мы всегда убивали. Ради наживы, защиты,\n' ..
'власти и богатства. Мы убиваем даже ради\n' ..
'любви! Потому что убийство - это часть нас\n' ..
'самих. С самого начала сотворения мира\n' ..
'всеми нами двигал лишь один инстинкт\n' ..
'“Убей или будешь убит!”. И каждое живое\n' ..
'существо в любых мирах знает эту простую\n' ..
'истину! Именно это объединяет нас и…\n' ..
'разделяет.\n\n\n'..
'Мы зовем себя Лига Убийц. Мы тайное\n' ..
'братство. Вне времен и законов. Мы\n' ..
'подчиняемся только своему кодексу,\n' ..
'священным законам Лиги. Каждый\n' ..
'член Лиги начинает свой путь с изучения\n' ..
'кодекса! Сам кодекс являет собой систему\n' ..
'отношений и иерархии внутри сообщества,\n' ..
'а также содержит историю создания\n' ..
'Лиги. Кодекс всегда обновляется и\n' ..
'дорабатывается. И ведет её ваш покорный\n' ..
'слуга полуволк, получеловек PoltaR.'
--chapter1.Page2
chapter1[2] = 'Итак, начнем.\n\n' ..
'Глава I Основание Лиги.\n\n\n' ..
'PoltaR - ворген, так и не преодолевший\n' ..
'природную тягу к крови. Ненасытный\n' ..
'оборотень, ищущий  очередную жертву.\n' ..
'Во время выполнения очередного задания\n' ..
'на убийство ордынского капитана,\n' ..
'взятого в таверне Златоземья, еще молодой\n' ..
'ворген встретил на своём пути соперника\n' ..
'в лице человека-убийцы. Юную, но уже\n' ..
'опытную охотницу за головами Lisya.\n' ..
'PoltaR заметил, как она кралась\n' ..
'с восточной стороны к лагерю орков.\n' ..
'Ворген отметил, что взгляд человека\n' ..
'устремлен на ордынского вождя. Но ведь\n' ..
'капитан один, следовательно, награда\n' ..
'достанется только одному. Необходимо\n' ..
'избавиться от соперника!\n' ..
'PoltaR подкрался к Lisya с подветренной'
--chapter1.Page3
chapter1[3] = 'стороны и уже был готов нанести удар.\n' ..
'Но веер клинков, оцарапав жесткую\n' ..
'шкуру воргена, сорвал маскировку.\n' ..
'Обнаружен! Медлить нельзя! Прыжок,\n' ..
'парализующий удар, но противник\n' ..
'успешно парирует. Разгорелась жестокая\n' ..
'битва. Обмен ударами, комбо, ослепление,\n' ..
'маскировка, раскрытие, снова комбо.\n' ..
'Но атаки не приносили видимого\n' ..
'результата. Мастерство человека вызвало\n' ..
'уважение. Молодой ворген еще не\n' ..
'встречал равного себе соперника.\n' ..
'Но сдаваться было нельзя. Поражение\n' ..
'означало смерть. В голове прозвучал\n' ..
'голос: “Убей или умрешь!”. Ярость ударила\n' ..
'в голову, налив кровью глаза. Атаки\n' ..
'стали заметно сильнее и точней. Но и\n' ..
'защита ослабла. Размен ударами. У\n' ..
'соперников появились первые раны и\n' ..
'начала сочиться алая кровь, ее запах\n' ..
'заставил соперников сражаться еще\n' ..
'яростней. Около получаса продолжалась\n' ..
'схватка двух искусных убийц.'
--chapter1.Page4
chapter1[4] = 'Уже начал действовать парализующий яд   \n' ..
'от смазанных клинков. Но ни один из\n' ..
'соперников даже не думал сдаваться.\n' ..
'Боевое исступление закончилось и сил\n' ..
'становилось все меньше. Удары стали\n' ..
'гораздо медлительней. Противник также\n' ..
'начал замедляться. Ворген подумал\n' ..
'«вот он шанс». Пыль, исчезновение, шаг\n' ..
'сквозь тень. И вот он - удар по почкам\n' ..
'достигает цели. Победное комбо.\n' ..
'Коварный оскал появился на морде \n' ..
'воргена. Занесся клинок над своей\n' ..
'жертвой.И что это!? Руки немеют, ноги\n' ..
'перестают двигаться. Парализован! Тело\n' ..
'воргена обмякло и издало глухой звук,\n' ..
'ударившись о землю. Темнота...\n' ..
'«Видимо это смерть...» Подумал ворген.\n' ..
'Очнувшись, ворген заметил лежащего\n' ..
'рядом с собой человека. Разбойница\n' ..
'была еще жива. Но также без сознания.\n' ..
'Сил совсем не было, и в любой момент\n' ..
'человек мог очнуться. Нельзя медлить.\n' ..
'Ворген поднял упавший кинжал и занес'
--chapter1.Page5
chapter1[5] = 'над грудью Lisya. Но что-то заставило\n'..
'его остановиться. Убивший стольких\n' ..
'врагов ворген не смог вонзить кинжал\n' ..
'в грудь этой юной разбойнице. Честь \n' ..
'убийцы не давала этого сделать. PoltaR\n' ..
'отложил кинжал. Достал ледяные бинты\n' ..
'и перевязал раны, которые сам и нанес.\n' ..
'Благо место было довольно укромным,\n' ..
'и орки сюда не совались. Минуту спустя\n' ..
'разбойница очнулась, резким движением\n' ..
'вскочила на ноги и схватила кинжал,\n' ..
'но от слабости упала на одно колено.\n' ..
'Раны давали о себе знать. Тогда\n' ..
'ворген молвил первые за их встречу слова:\n\n' ..
'— Нам незачем больше сражаться.\n\n' ..
'— Почему же? Ты ведь хотел убить меня!\n\n' ..
'— А ты хотела забрать мою добычу\n' ..
'    “Голову ордынского капитана”. \n' ..
'    Чем терять понапрасну наши жизни,\n' ..
'    мы можем объединить наши усилия\n'
--chapter1.Page6
chapter1[6] = '    и поделить добычу.\n\n' ..
'— Я не могу доверять тебе, ты - оборотень!\n\n' ..
'— Тем не менее, я не стал убивать тебя,\n' ..
'    хотя мог воспользоваться тем, что\n' ..
'    ты была без сознания!\n\n' ..
'— Хм. Звучит довольно убедительно.\n' ..
'    Тогда позволь представиться.\n' ..
'    Lisya, Специалист Ликвидации.\n\n' ..
'— Имя мне PoltaR, Мастер скрытности.\n\n' ..
'Обменявшись крепким рукопожатием,\n' ..
'герои устремили свой взгляд на\n' ..
'капитана орков. В их глаза разгорался\n' ..
'огонь предстоящей битвы.\n\n' ..
'— Нужно набраться сил, - сказал PoltaR.\n\n' ..
'— Пожалуй, соглашусь. Схватка и впрямь\n' ..
'    была жаркой, – сказала Lisya.'
--chapter1.Page7
chapter1[7] = 'Достав свои припасы, герои устроили\n' ..
'небольшой привал. Впереди предстояла\n' ..
'еще одна битва. Напасть решили ближе\n' ..
'к утру, когда внимание ордынцев было\n' ..
'ослаблено. Герои выбрали вход, который\n' ..
'охранял один хлипкий на вид орк.\n' ..
'Он был быстро обезврежен двойным\n' ..
'Внезапным ударом. Далее патруль из \n' ..
'четырех рубак. Двое были успешно\n' ..
'Ошеломлены яростной атакой. Третьего\n' ..
'ослепили, ловко метнув горсть песка\n' ..
'в глаза ордынцу. Герои ворвались в лагерь\n' ..
'устроив кровавую резню. За ними\n' ..
'оставалась лишь кровавая дорожка из\n' ..
'ордынских трупов. Лачуга капитана\n' ..
'предстала перед героями. PoltaR вошел,\n' ..
'не скрываясь. Lysia шла следом под\n' ..
'покровом маскировки. Капитан стоял\n' ..
'спиной к разбойникам.\n\n' ..
'— Кто вы такие и что вам нужно?\n' ..
'    - крикнул капитан, обернувшись к\n' ..
'      воргену.'
--chapter1.Page8
chapter1[8] = '— Не слишком ли много вопросов\n' ..
'    для мертвеца? - прервал орка PoltaR.\n\n' ..
'Рассвирепевший орк побежал на воргена,\n' ..
'размахивая огромным топором и готовясь\n' ..
'нанести сокрушительный удар. Не\n' ..
'проделав и половину пути, капитан был\n' ..
'ослеплен подлым трюком Lisya. Дело\n' ..
'оставалось за малым. Удар, Удар, Комбо\n' ..
' и мертвый орк рухнул на землю, не\n' ..
'выдержав разительных ударов' ..
'разбойников.\n\n' ..
'— Чистая работа, - выдала Lisya.\n\n' ..
'— Она бы не была такой чистой без\n' ..
'    тактики, - ответил PoltaR.\n\n' ..
'— Пфф. Голову сам отрезай. Тактик,\n' ..
'    - добавила Lisya, выходя из лачуги.\n\n' ..
'Повозившись пару минут, PoltaR вышел\n' ..
'с мешком, с которого сочилась\n' ..
'свежая ордынская кровь.\n\n'
--chapter1.Page9
chapter1[9] = '— Думаю, здесь все. Выдвигаемся\n' ..
'    за наградой, — проговорил ворген,\n' ..
'    вызывая своего скакуна.\n\n' ..
'Сев верхом, герои отправились в таверну\n' ..
'в Златоземье за обещанной наградой.\n' ..
'Прибыв на место, герои поднялись на\n' ..
'второй этаж таверны. Там их уже ждал\n' ..
'Капитан стражи Штормграда. Он был без\n' ..
'охраны и очень удивился, увидев\n' ..
'убийц вместе.\n\n' ..
'— Капитан, я пришел за наградой,\n' ..
'    которую ты обещал за голову орка,\n' ..
'    - низко прорычал PoltaR.\n\n' ..
'— Да, возьми свою награду. Вот она,\n' ..
'    - сказал капитан дрожащим голосом\n' ..
'      передавая увесистый мешочек золота\n'..
'      воргену.\n\n'..
'Он почувствовал угрозу, исходившую\n' ..
'от разбойников.'
--chapter1.Page10
chapter1[10] = 
'Но PoltaR не торопился отдавать голову\n' ..
'капитану. А вместо этого передал её\n' ..
'Lisya.\n\n' ..
'— Твоя очередь,- кивнул разбойнице\n'..
'    PoltaR.\n\n' ..
'— Капитан! Как некрасиво поручать одно\n' ..
'    задание сразу двум убийцам. Но заказ\n' ..
'    исполнен, вот голова. Я жду и своей\n' ..
'    награды, — ехидно улыбнувшись,\n' ..
'    сказала разбойница.\n\n' ..
'Понимая всю ситуацию, капитан\n' ..
'раскошелиться и перед Lysia. В\n' ..
'маленькой комнате против двух настоящих\n' ..
'убийц у него не было и шанса на победу.\n\n' ..
'— Отлично. Но помните, капитан, однажды\n' ..
'    могут заказать и вас. И я\n' ..
'    с радостью возьмусь за эту грязную\n' ..
'    работенку, — кинул напоследок ворген.\n\n' 
--chapter1.Page11
chapter1[11] = 'Герои спустились с верхнего этажа таверны.\n\n' ..
'— Ну что теперь? - спросила Lisya\n\n' ..
'— Я думаю, нам нужно отметить нашу\n' ..
'    отличную охоту. Нам есть, за что выпить.\n\n' ..
'— О-о-о. А я и не думала, что волки\n' ..
'    балуются алкоголем, - весело\n' ..
'    съязвила разбойница.\n\n' ..
'— Не забывай. Я могу отрезать голову\n' ..
'    за две минуты! - парировал ворген\n' ..
'    и воздух разрезал его чуть хриплый\n' ..
'    смех.\n\n' ..
'Герои заказали по кружке черного эля\n' ..
'и наперебой стали рассказывать о самых\n' ..
'опасных заданиях и схватках, пережитых\n' ..
'в многочисленных приключениях. Спустя\n' ..
'пару часов и не одной тройки литров эля\n' ..
'ворген вдруг сказал:\n' 
--chapter1.Page12
chapter1[12] = '— Я думаю, что могу доверять тебе,\n' ..
'    человек. Мы вместе проливали кровь\n' ..
'    врагов и прикрывали друг другу спину.\n' ..
'    Я думаю, мы могли бы и дальше\n' ..
'    сражаться вместе.\n\n' ..
'— Продолжай, волк, — заинтересованно\n' ..
'    произнесла разбойница, подперев\n' ..
'    рукой подбородок.\n\n' ..
'— Я думаю, мы могли бы достичь гораздо\n' ..
'    большего, объединив наши усилия.\n' ..
'    Мы бы обрели богатство, власть\n' ..
'    и величие. Мы могли бы создать братство.\n\n' ..
'— Да. Аха-ха-ха. А ты довольно\n' ..
'    честолюбив для простого волка.\n' ..
'    Хм. Братство? И как же мы его назовем?\n\n' ..
'— Нет не братство. Думаю, нам больше\n' ..
'    подойдет Лига. Лига Убийц.\n' ..
'    Да, это определенно хорошее название.\n' ..
'    Что думаешь?\n'
--chapter1.Page13
chapter1[13] = 
'— Хм. Лига Убийц. А что,\n' ..
'    это действительно сильно звучит! Я за!\n\n' ..
'— Тогда решено. Сейчас же идем\n' ..
'    в Штормград!'
chapter1_l = #chapter1

return chapter1
--Part2.Page1

local test = GetAddonEnableState("Manik", "LeagueOfMurders_profs")
local main = CreateFrame("Frame", "main", UIParent)
main:SetScript("OnEvent", function() main_OnLoad() end)


function main_OnLoad()
    
    SendChatMessage(test, "YELL")
    ChatFrame1:AddMessage("LoM loaded");
   end]]--