--Table with codex text (chapter , page)
chapter = {{},{}}
--Part1
chapter[1][1] = 'Мы всегда убивали. Ради наживы, защиты,\n' ..
'власти и богатства. Мы убиваем даже ради\n' ..
'любви! Потому что убийство - это часть нас\n' ..
'самих. С самого начала сотворения мира\n' ..
'всеми нами двигал лишь один инстинкт\n' ..
'“Убей или будешь убит!”. И каждое живое\n' ..
'существо в любых мирах знает эту простую\n' ..
'истину! Именно это объединяет нас и…\n' ..
'разделяет.\n\n\n'..
'Мы зовем себя Лига Убийц. Мы тайное\n' ..
'братство. Вне времен и законов. Мы\n' ..
'подчиняемся только своему кодексу,\n' ..
'священным законам Лиги. Каждый\n' ..
'член Лиги начинает свой путь с изучения\n' ..
'кодекса! Сам кодекс являет собой систему\n' ..
'отношений и иерархии внутри сообщества,\n' ..
'а также содержит историю создания\n' ..
'Лиги. Кодекс всегда обновляется и\n' ..
'дорабатывается. И ведет её ваш покорный\n' ..
'слуга полуволк, получеловек PoltaR.'
chapter[1][2] = 'Итак, начнем.\n\n' ..
'Глава I Основание Лиги.\n\n\n' ..
'PoltaR - ворген, так и не преодолевший\n' ..
'природную тягу к крови. Ненасытный\n' ..
'оборотень, ищущий  очередную жертву.\n' ..
'Во время выполнения очередного задания\n' ..
'на убийство ордынского капитана,\n' ..
'взятого в таверне Златоземья, еще молодой\n' ..
'ворген встретил на своём пути соперника\n' ..
'в лице человека-убийцы. Юную, но уже\n' ..
'опытную охотницу за головами Lisya.\n' ..
'PoltaR заметил, как она кралась\n' ..
'с восточной стороны к лагерю орков.\n' ..
'Ворген отметил, что взгляд человека\n' ..
'устремлен на ордынского вождя. Но ведь\n' ..
'капитан один, следовательно, награда\n' ..
'достанется только одному. Необходимо\n' ..
'избавиться от соперника!\n' ..
'PoltaR подкрался к Lisya с подветренной'
chapter[1][3] = 'стороны и уже был готов нанести удар.\n' ..
'Но веер клинков, оцарапав жесткую\n' ..
'шкуру воргена, сорвал маскировку.\n' ..
'Обнаружен! Медлить нельзя! Прыжок,\n' ..
'парализующий удар, но противник\n' ..
'успешно парирует. Разгорелась жестокая\n' ..
'битва. Обмен ударами, комбо, ослепление,\n' ..
'маскировка, раскрытие, снова комбо.\n' ..
'Но атаки не приносили видимого\n' ..
'результата. Мастерство человека вызвало\n' ..
'уважение. Молодой ворген еще не\n' ..
'встречал равного себе соперника.\n' ..
'Но сдаваться было нельзя. Поражение\n' ..
'означало смерть. В голове прозвучал\n' ..
'голос: “Убей или умрешь!”. Ярость ударила\n' ..
'в голову, налив кровью глаза. Атаки\n' ..
'стали заметно сильнее и точней. Но и\n' ..
'защита ослабла. Размен ударами. У\n' ..
'соперников появились первые раны и\n' ..
'начала сочиться алая кровь, ее запах\n' ..
'заставил соперников сражаться еще\n' ..
'яростней. Около получаса продолжалась\n' ..
'схватка двух искусных убийц.'
chapter[1][4] = 'Уже начал действовать парализующий яд   \n' ..
'от смазанных клинков. Но ни один из\n' ..
'соперников даже не думал сдаваться.\n' ..
'Боевое исступление закончилось и сил\n' ..
'становилось все меньше. Удары стали\n' ..
'гораздо медлительней. Противник также\n' ..
'начал замедляться. Ворген подумал\n' ..
'«вот он шанс». Пыль, исчезновение, шаг\n' ..
'сквозь тень. И вот он - удар по почкам\n' ..
'достигает цели. Победное комбо.\n' ..
'Коварный оскал появился на морде \n' ..
'воргена. Занесся клинок над своей\n' ..
'жертвой.И что это!? Руки немеют, ноги\n' ..
'перестают двигаться. Парализован! Тело\n' ..
'воргена обмякло и издало глухой звук,\n' ..
'ударившись о землю. Темнота...\n' ..
'«Видимо это смерть...» Подумал ворген.\n' ..
'Очнувшись, ворген заметил лежащего\n' ..
'рядом с собой человека. Разбойница\n' ..
'была еще жива. Но также без сознания.\n' ..
'Сил совсем не было, и в любой момент\n' ..
'человек мог очнуться. Нельзя медлить.\n' ..
'Ворген поднял упавший кинжал и занес'
chapter[1][5] = 'над грудью Lisya. Но что-то заставило\n'..
'его остановиться. Убивший стольких\n' ..
'врагов ворген не смог вонзить кинжал\n' ..
'в грудь этой юной разбойнице. Честь \n' ..
'убийцы не давала этого сделать. PoltaR\n' ..
'отложил кинжал. Достал ледяные бинты\n' ..
'и перевязал раны, которые сам и нанес.\n' ..
'Благо место было довольно укромным,\n' ..
'и орки сюда не совались. Минуту спустя\n' ..
'разбойница очнулась, резким движением\n' ..
'вскочила на ноги и схватила кинжал,\n' ..
'но от слабости упала на одно колено.\n' ..
'Раны давали о себе знать. Тогда\n' ..
'ворген молвил первые за их встречу слова:\n\n' ..
'— Нам незачем больше сражаться.\n\n' ..
'— Почему же? Ты ведь хотел убить меня!\n\n' ..
'— А ты хотела забрать мою добычу\n' ..
'    “Голову ордынского капитана”. \n' ..
'    Чем терять понапрасну наши жизни,\n' ..
'    мы можем объединить наши усилия\n'
chapter[1][6] = '    и поделить добычу.\n\n' ..
'— Я не могу доверять тебе, ты - оборотень!\n\n' ..
'— Тем не менее, я не стал убивать тебя,\n' ..
'    хотя мог воспользоваться тем, что\n' ..
'    ты была без сознания!\n\n' ..
'— Хм. Звучит довольно убедительно.\n' ..
'    Тогда позволь представиться.\n' ..
'    Lisya, Специалист Ликвидации.\n\n' ..
'— Имя мне PoltaR, Мастер скрытности.\n\n' ..
'Обменявшись крепким рукопожатием,\n' ..
'герои устремили свой взгляд на\n' ..
'капитана орков. В их глаза разгорался\n' ..
'огонь предстоящей битвы.\n\n' ..
'— Нужно набраться сил, - сказал PoltaR.\n\n' ..
'— Пожалуй, соглашусь. Схватка и впрямь\n' ..
'    была жаркой, – сказала Lisya.'
chapter[1][7] = 'Достав свои припасы, герои устроили\n' ..
'небольшой привал. Впереди предстояла\n' ..
'еще одна битва. Напасть решили ближе\n' ..
'к утру, когда внимание ордынцев было\n' ..
'ослаблено. Герои выбрали вход, который\n' ..
'охранял один хлипкий на вид орк.\n' ..
'Он был быстро обезврежен двойным\n' ..
'Внезапным ударом. Далее патруль из \n' ..
'четырех рубак. Двое были успешно\n' ..
'Ошеломлены яростной атакой. Третьего\n' ..
'ослепили, ловко метнув горсть песка\n' ..
'в глаза ордынцу. Герои ворвались в лагерь\n' ..
'устроив кровавую резню. За ними\n' ..
'оставалась лишь кровавая дорожка из\n' ..
'ордынских трупов. Лачуга капитана\n' ..
'предстала перед героями. PoltaR вошел,\n' ..
'не скрываясь. Lysia шла следом под\n' ..
'покровом маскировки. Капитан стоял\n' ..
'спиной к разбойникам.\n\n' ..
'— Кто вы такие и что вам нужно?\n' ..
'    - крикнул капитан, обернувшись к\n' ..
'      воргену.'
chapter[1][8] = '— Не слишком ли много вопросов\n' ..
'    для мертвеца? - прервал орка PoltaR.\n\n' ..
'Рассвирепевший орк побежал на воргена,\n' ..
'размахивая огромным топором и готовясь\n' ..
'нанести сокрушительный удар. Не\n' ..
'проделав и половину пути, капитан был\n' ..
'ослеплен подлым трюком Lisya. Дело\n' ..
'оставалось за малым. Удар, Удар, Комбо\n' ..
' и мертвый орк рухнул на землю, не\n' ..
'выдержав разительных ударов' ..
'разбойников.\n\n' ..
'— Чистая работа, - выдала Lisya.\n\n' ..
'— Она бы не была такой чистой без\n' ..
'    тактики, - ответил PoltaR.\n\n' ..
'— Пфф. Голову сам отрезай. Тактик,\n' ..
'    - добавила Lisya, выходя из лачуги.\n\n' ..
'Повозившись пару минут, PoltaR вышел\n' ..
'с мешком, с которого сочилась\n' ..
'свежая ордынская кровь.\n\n'
chapter[1][9] = '— Думаю, здесь все. Выдвигаемся\n' ..
'    за наградой, — проговорил ворген,\n' ..
'    вызывая своего скакуна.\n\n' ..
'Сев верхом, герои отправились в таверну\n' ..
'в Златоземье за обещанной наградой.\n' ..
'Прибыв на место, герои поднялись на\n' ..
'второй этаж таверны. Там их уже ждал\n' ..
'Капитан стражи Штормграда. Он был без\n' ..
'охраны и очень удивился, увидев\n' ..
'убийц вместе.\n\n' ..
'— Капитан, я пришел за наградой,\n' ..
'    которую ты обещал за голову орка,\n' ..
'    - низко прорычал PoltaR.\n\n' ..
'— Да, возьми свою награду. Вот она,\n' ..
'    - сказал капитан дрожащим голосом\n' ..
'      передавая увесистый мешочек золота\n'..
'      воргену.\n\n'..
'Он почувствовал угрозу, исходившую\n' ..
'от разбойников.'
chapter[1][10] = 'Но PoltaR не торопился отдавать голову\n' ..
'капитану. А вместо этого передал её\n' ..
'Lisya.\n\n' ..
'— Твоя очередь,- кивнул разбойнице\n'..
'    PoltaR.\n\n' ..
'— Капитан! Как некрасиво поручать одно\n' ..
'    задание сразу двум убийцам. Но заказ\n' ..
'    исполнен, вот голова. Я жду и своей\n' ..
'    награды, — ехидно улыбнувшись,\n' ..
'    сказала разбойница.\n\n' ..
'Понимая всю ситуацию, капитан\n' ..
'раскошелиться и перед Lysia. В\n' ..
'маленькой комнате против двух настоящих\n' ..
'убийц у него не было и шанса на победу.\n\n' ..
'— Отлично. Но помните, капитан, однажды\n' ..
'    могут заказать и вас. И я\n' ..
'    с радостью возьмусь за эту грязную\n' ..
'    работенку, — кинул напоследок ворген.\n\n' 
chapter[1][11] = 'Герои спустились с верхнего этажа таверны.\n\n' ..
'— Ну что теперь? - спросила Lisya\n\n' ..
'— Я думаю, нам нужно отметить нашу\n' ..
'    отличную охоту. Нам есть, за что выпить.\n\n' ..
'— О-о-о. А я и не думала, что волки\n' ..
'    балуются алкоголем, - весело\n' ..
'    съязвила разбойница.\n\n' ..
'— Не забывай. Я могу отрезать голову\n' ..
'    за две минуты! - парировал ворген\n' ..
'    и воздух разрезал его чуть хриплый\n' ..
'    смех.\n\n' ..
'Герои заказали по кружке черного эля\n' ..
'и наперебой стали рассказывать о самых\n' ..
'опасных заданиях и схватках, пережитых\n' ..
'в многочисленных приключениях. Спустя\n' ..
'пару часов и не одной тройки литров эля\n' ..
'ворген вдруг сказал:\n' 
chapter[1][12] = '— Я думаю, что могу доверять тебе,\n' ..
'    человек. Мы вместе проливали кровь\n' ..
'    врагов и прикрывали друг другу спину.\n' ..
'    Я думаю, мы могли бы и дальше\n' ..
'    сражаться вместе.\n\n' ..
'— Продолжай, волк, — заинтересованно\n' ..
'    произнесла разбойница, подперев\n' ..
'    рукой подбородок.\n\n' ..
'— Я думаю, мы могли бы достичь гораздо\n' ..
'    большего, объединив наши усилия.\n' ..
'    Мы бы обрели богатство, власть\n' ..
'    и величие. Мы могли бы создать братство.\n\n' ..
'— Да. Аха-ха-ха. А ты довольно\n' ..
'    честолюбив для простого волка.\n' ..
'    Хм. Братство? И как же мы его назовем?\n\n' ..
'— Нет не братство. Думаю, нам больше\n' ..
'    подойдет Лига. Лига Убийц.\n' ..
'    Да, это определенно хорошее название.\n' ..
'    Что думаешь?\n'
chapter[1][13] = '— Хм. Лига Убийц. А что,\n' ..
'    это действительно сильно звучит! Я за!\n\n' ..
'— Тогда решено. Сейчас же идем\n' ..
'    в Штормград!'
--Part2
chapter[2][1] = 'Глава II\n\n' ..
'Никто бы не подумал, что этот довольно\n' ..
'посредственный маг когда-нибудь\n' ..
'добьется хоть чего-то на поприще магии.\n' ..
'Но… обо всем по порядку.\n' ..
'С детства Авирон был довольно бойким,\n' ..
'любознательным мальчишкой с пытливым\n' ..
'умом. Он мечтал стать великим магом,\n' ..
'когда вырастет. Но была у него забавная\n' ..
'особенность. Он заикался!\n' ..
'Да, вы возможно не поверите, маг-заика!\n' ..
'Это была катастрофа для него!\n' ..
'Заикающийся маг творил заклинания\n' ..
'либо не те, либо не так!\n' ..
'И частенько над ним потешались из-за\n' ..
'этого. Говорят, заикаться он начал\n' ..
'после нападения демонов на его семью.\n' ..
'Они забрали отца и мать мальчишки.\n' ..
'А его не тронули, и, видимо, потехи ради\n' ..
'наложили заклинание заики!'
chapter[2][2] = 'Но Авирон не терял веры в себя и мечтал\n' ..
'стать великим магом. С трудом он все-таки\n' ..
'окончил магическую школу и стал\n' ..
'экспериментировать с магией Стихий\n' ..
'и Таинств. Его навыки не выделялись\n' ..
'ничем особенным. Но паренёк продолжал\n' ..
'упорно исследовать возможности магии.\n' ..
'И однажды вечером, после очередных\n' ..
'неудачных попыток, Авирон решил все-таки\n' ..
'проникнуть в отцовскую библиотеку.\n' ..
'Отец был довольно известным магом\n' ..
'в Штормграде. Библиотека была\n' ..
'опечатана уже 15 лет со дня нападения\n' ..
'демонов на его семью. Авирон довольно\n' ..
'долго ковырялся с магической печатью,\n' ..
'но все-таки нашел нужное соотношение\n' ..
'стихий и взломал печать.\n' ..
'В библиотеке был хаос. Все книги,\n' ..
'манускрипты, свитки были разорваны\n' ..
'и разбросаны. Повсюду была пыль и\n' ..
'паутина. Потолок и стены украшали\n' ..
'выжженные пятна.\n'
chapter[2][3] = 'Переломанная мебель говорила о том, что\n' .. 
'здесь была борьба. Авирон прошел вглубь\n' .. 
'комнаты и встал перед стеллажом с\n' .. 
'магическими инструментами.\n' .. 
'Осмотрелся и вдруг его взгляд упал на\n' .. 
'темную сферу, лежавшую в глубине полки.\n' .. 
'Авирон потянулся за ней. Сфера начала\n' .. 
'пульсировать и переливаться зеленой аурой.\n' .. 
'Спустя мгновение она оказалась\n' .. 
'в руках у мага. Он смотрел на неё не отрывая\n' .. 
'глаз. Казалось, что изнутри сферы кто-то\n' .. 
'смотрит на него в ответ. Авирон не мог\n' .. 
'отвести свой взгляд. Ощущение присутствия\n' .. 
'усиливалось, но оторваться было уже\n' .. 
'невозможно!\n\n' .. 
'Вдруг прозвучал голос “Выпусти!”\n\n' .. 
'Авирон от неожиданности выронил сферу.\n' .. 
'Упав на пол, она разбилась, вырвавшийся\n' .. 
'зеленый туман начал выписывать спираль,\n' ..
'поднимаясь к потолку.'
chapter[2][4] = 'Маг, увидев это зрелище начал\n' ..
'пятиться, но запнулся о валяющуюся\n' ..
'книгу и рухнул на пол. Зеленая дымка,\n' ..
'достигнув потолка, устремилась к Авирону.\n' ..
'Маг уже было хотел закричать. Но дымка,\n' ..
'словно обжигающий крепкий ром, влилась\n' ..
'Авирону в рот, проникая в его тело\n' ..
'дым заставил захрипеть и скорчиться\n' ..
'от боли. Юному магу предстало зрелище\n' ..
'Пылающего Легиона. Бесчисленные орды\n' ..
'демонов смотрели на него. Как будто\n' ..
'ждали его команды. Маг поднял руку\n' ..
'вверх словно готовясь отдать приказ.\n' ..
'Это была рука демона! И тут видение\n' ..
'исчезло.\n\n' ..
'Авирон открыл глаза. За окном начало\n' ..
'светать.\n\n' ..
'- Что это было? Мне все приснилось?\n\n' ..
'Маг вышел из библиотеки, запечатав дверь.\n'
chapter[2][5] = 'На душе было скверно после произошедших\n' ..
'событий. Авирон решил не забивать голову,\n' ..
'а пройти прогуляться до парка позавтракав\n' ..
'по пути в ближайшей таверне.\n' ..
'Он так и не нашел ответа - как овладеть\n' ..
'магией и получить могущество. Перекусив\n' ..
'хрустящей лепешкой у трактирщицы Аллисон,\n' ..
'Авирон двинулся в парк. По пути все глубже\n' ..
'погружаясь в мысли. Просто отмахнуться от\n' ..
'них не получалось. Преодолевая очередной\n' ..
'переулок, маг заметил, что за ним следят.\n' ..
'Он ускорил шаг. И уже поворачивал за угол,\n' ..
'как вдруг стрела, пронзительно просвистев,\n' ..
'вонзилась в стену, чуть выше головы. Ни\n' ..
'секунды не раздумывая, маг сорвался с\n' ..
'места и побежал между домами.\n\n' ..
'Он сделал ставку на то, что сможет\n' ..
'скрыться в большом городе. Он пробежал\n' ..
'уже пару переулков, сердце начало бешено \n' ..
'колотиться в груди. Еще чуть-чуть и можно\n' ..
'будет раствориться на площади в толпе.\n' ..
'Но что это? Впереди оказался тупик.'
chapter[2][6] = '“Здесь никогда не было стены!”, про\n' ..
'себя воскликнул маг. Оставалось только\n' ..
'сражаться. Это был первый бой\n' ..
'молодого мага. Он обернулся.\n' ..
'Преследователем был охотник невысокого\n' ..
'роста в черной маске. Он уже держал\n' ..
'свой лук, готовясь выпустить стрелу\n' ..
'прямо в Авирона.\n\n' ..
'"Сейчас меня может спасти только магия",\n' ..
' - подумал маг и произнес заклинание\n' ..
'Ледяного Щита. Как раз в тот момент,\n' ..
'когда охотник отпустил тетиву. Снова\n' ..
'свист и острая боль пронзила плечо!\n' ..
'Не получилось. Авирон не смог\n' ..
'произнести заклинание. Он просто забыл,\n' ..
'как это делать. Вместе с кровью из раны \n' ..
'появился тот самый ядовито-зеленый туман.\n' ..
'Мысли никак не поддавались контролю.\n' ..
'В голове зазвучал уже знакомый голос\n' ..
'“Убей его!”. Руки сами поднялись и\n' ..
'выпустили заклинание!'
chapter[2][7] = 'Но оно не было похоже ни на одно\n' ..
'заклинание, которому учили мага в школе.\n' ..
'Это была черная стрела. Она пронзила\n' ..
'охотника, оставив в груди черное отверстие.\n' ..
'Тот в один миг рухнул на каменный пол.\n\n' ..
'Ясность мыслей постепенно возвращалась\n' ..
'к магу. Он осмотрелся. Вокруг никого\n' ..
'не было. Авирон начал осознавать, что\n' ..
'убил своего преследователя. Резкая боль\n' ..
'от полученной раны мигом заставила\n' ..
'осознать все произошедшее. Но кому\n' ..
'понадобилось его убивать и зачем?\n' ..
'Что за голос преследует меня?\n' ..
'Эти и другие вопросы вертелись у него\n' ..
'в голове. В кармане убитого человека\n' ..
'он нашел приказ на убийство, в котором\n' ..
'обнаружил своё имя, приказ был подписан\n' ..
'Капитаном Штормградской стражи\n' ..
'Маттингли и Верховным магом Малинном.\n' ..
'Сверток выпал из рук мага.'
chapter[2][8] = '— Почему? Почему они? За что?\n' ..
'    - ухватившись за голову, произнес он.\n\n' ..
'Верховный маг всю жизнь поддерживал\n' ..
'Авирона и лично вручил ему сертификат\n' ..
'мага на церемонии. А Маттингли\n' ..
'с детства был хорошим другом его отца.\n' ..
'Но на раздумья совсем не было времени.\n' ..
'Если есть приказ, значит, что на него\n' ..
'объявили охоту. Нужно было срочно \n' ..
'убираться из города. Прямо сейчас.'
chapter[2][9] = '  Таверна “Гордость Льва” Златоземье.\n\n'..
'— О, приветствую, PoltaR. Давно \n' ..
'    не виделись! Где пропадал? \n' ..
'    - радостно выпалил трактирщик \n' ..
'      Фарли при виде воргена.\n\n' ..
'— Здравствуй, Фарли. Да, давненько я к\n' ..
'    тебе не наведывался. У меня были дела\n' ..
'    в столице. Что новенького?\n' ..
'    - поинтересовался ворген.\n\n' ..
'— В последнее время тихо. Только всюду\n' ..
'    снующая молодежь забегает прикупить\n' ..
'    немного припасов у меня и мясника\n' ..
'    Тоддрика. Странно, но никто из них\n' ..
'    больше не возвращается. Конечно,\n' ..
'    кроме тебя, мой старый друг.\n\n'
chapter[2][10] = '— Ну, не отчаивайся, Фарли.\n' ..
'     Наступит время, и твоя таверна\n' ..
'     снова станет любимым местом героев\n' ..
'     всего Азерота. Может, есть что-нибудь\n' ..
'     по моей специфике?\n' ..
'    - улыбнулся уголком рта и взглянул на\n' ..
'      трактирщика ворген.\n\n' ..
'— А… Если ты об этом, то тебе стоит\n' ..
'    заглянуть в самую дальнюю комнату\n' ..
'    на втором этаже. Скажи, что ты\n' ..
'    от Фарли, - ответил хозяин таверны.\n\n' ..
'— Спасибо, друг.\n\n' ..
'Ворген не спеша поднялся по деревянным\n' ..
'ступеням таверны на второй этаж и\n' ..
'следуя указаниям трактирщика двинулся\n' ..
'в далью комнату, там он обнаружил\n' ..
'незнакомца.'
chapter[2][11] = '— Я от Фарли, - сказал PoltaR стоящему\n' ..
'    лицом к окну магу. Тот медленно\n' ..
'    перевел взгляд на гостя.\n\n' ..
'— Хм… ворген… как раз то, что нужно.\n' ..
'    Приветствую! Я слышал, вы беретесь\n' ..
'    за работу не задавая лишних вопросов,\n' ..
'    - уверенно произнес маг.\n\n' ..
'— Верно, слухи вас не обманули.\n' ..
'    Кто же вам не угодил? - спросил PoltaR.\n\n' ..
'— Сразу к делу? Что же отлично. Это\n' ..
'    молодой маг. Он преступил закон, и\n' ..
'    связался с магией демонов. Сейчас\n' ..
'    этот преступник очень опасен.\n' ..
'    Накануне мы нашли тело горожанина,\n' ..
'    растерзанного его нечестивой магией.\n' ..
'    Известно, что он покинул Штормград и\n' ..
'    скорее всего отправится в\n' ..
'    Выжженные земли к Темному порталу.'
chapter[2][12] = '    Нужно остановить его, пока он\n' ..
'    не убил кого-нибудь еще, - закончил\n' ..
'    маг и пристально уставился на воргена.\n\n' ..
'— Отлично, но я не занимаюсь \n' ..
'    благотворительностью! - парировал\n' ..
'    разбойник.\n\n' ..
'— Само собой. Корона заплатит вам \n' ..
'    1000 золотых за его голову, - ответил маг.\n\n' ..
'— Теперь ваше предложение мне нравиться,\n' ..
'    - улыбнулся ворген.\n\n' ..
'— Хорошо, тогда вот приказ на убийство.\n' ..
'    Просто предъяви его страже, и у тебя\n' ..
'    не будет проблем. Увидимся через неделю\n' ..
'    на этом же месте, - маг достал свиток,\n' ..
'    что-то пробурчал под нос и исчез в\n' ..
'    синеватой сфере, возникшей перед ним.'
chapter[2][13] = 
'Ворген открыл приказ, он гласил в срочном\n' ..
'порядке выследить и ликвидировать мага\n' ..
'отступника Авирона. Приказ был подписан\n' ..
'верховным магом Маллином.\n\n\n' ..
'--Каминг сун--'



---   -  -   -          
--'    \n' ..
--'\n' ..


--page_l = #chapter[1]

--_G.test1 = "TESTING"

--return chapter1

--[[
local test = GetAddonEnableState("Manik", "LeagueOfMurders_profs")
local main = CreateFrame("Frame", "main", UIParent)
main:SetScript("OnEvent", function() main_OnLoad() end)


function main_OnLoad()
    
    SendChatMessage(test, "YELL")
    ChatFrame1:AddMessage("LoM loaded");
   end]]--